Importing pandas and numpy:

In [1]:
import pandas as pd
import numpy as np

Loading the StudentPerformance DataFile

In [2]:
df=pd.read_csv('StudentsPerformance.csv')

In [3]:
df.head()

,Unnamed: 0,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_map,...,test_preparation_course_map,Result,math_performance,reading_performance,writing_performance,total,percentage,grades,Result_map,grades_map
0,0,female,group B,bachelor's degree,standard,none,72,72,74,1,...,0,Pass,1,1,1,218,72.666667,first,1,3
1,1,female,group C,some college,standard,completed,69,90,88,1,...,1,Pass,1,1,1,247,82.333333,Distinction,1,4
2,2,female,group B,master's degree,standard,none,90,95,93,1,...,0,Pass,1,1,1,278,92.666667,Distinction,1,4
3,3,male,group A,associate's degree,free/reduced,none,47,57,44,0,...,0,Pass,1,1,1,148,49.333333,third,1,1
4,4,male,group C,some college,standard,none,76,78,75,0,...,0,Pass,1,1,1,229,76.333333,first,1,3

Data Cleaning

Checking for null value in DataFile:

In [4]:
df.isnull().sum()

Unnamed: 0                          0
gender                              0
race/ethnicity                      0
parental level of education         0
lunch                               0
test preparation course             0
math score                          0
reading score                       0
writing score                       0
gender_map                          0
race/ethinicity_map                 0
parental_level_of_education_map     0
lunch_map                           0
test_preparation_course_map         0
Result                              0
math_performance                    0
reading_performance                 0
writing_performance                 0
total                               0
percentage                          0
grades                             61
Result_map                          0
grades_map                          0
dtype: int64

Since,there are no null values. Converting categorized data to numeric data:

In [5]:
#Checking unique values and mapping gender column to numerical data column
df['gender'].unique()

array(['female', 'male'], dtype=object)

In [6]:
gender={'female':1, 'male':0}

In [7]:
df['gender_map']=df['gender'].map(gender)

In [8]:
#Checking unique values and mapping race/ethinicity column to numerical data column
df['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

In [9]:
race={'group B':1, 'group C':2, 'group A':3, 'group D':4, 'group E':5}

In [10]:
df['race/ethinicity_map']=df['race/ethnicity'].map(race)

In [11]:
#Checking unique values and mapping parental level of education column to numerical data column
df['parental level of education'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [12]:
education={"bachelor's degree":1, 'some college':6, "master's degree":2,
       "associate's degree":3, 'high school':4, 'some high school':5}

In [13]:
df['parental_level_of_education_map']=df['parental level of education'].map(education)

In [14]:
#Checking unique values and mapping lunch column to numerical data column
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

In [15]:
lunch={'standard':1, 'free/reduced':2}

In [16]:
df['lunch_map']=df['lunch'].map(lunch)

In [17]:
#Checking unique values and mapping test preparation column to numerical data column
df['test preparation course'].unique()

array(['none', 'completed'], dtype=object)

In [18]:
course={'none':0, 'completed':1}

In [19]:
df['test_preparation_course_map']=df['test preparation course'].map(course)

In [20]:
df.head()

,Unnamed: 0,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_map,...,test_preparation_course_map,Result,math_performance,reading_performance,writing_performance,total,percentage,grades,Result_map,grades_map
0,0,female,group B,bachelor's degree,standard,none,72,72,74,1,...,0,Pass,1,1,1,218,72.666667,first,1,3
1,1,female,group C,some college,standard,completed,69,90,88,1,...,1,Pass,1,1,1,247,82.333333,Distinction,1,4
2,2,female,group B,master's degree,standard,none,90,95,93,1,...,0,Pass,1,1,1,278,92.666667,Distinction,1,4
3,3,male,group A,associate's degree,free/reduced,none,47,57,44,0,...,0,Pass,1,1,1,148,49.333333,third,1,1
4,4,male,group C,some college,standard,none,76,78,75,0,...,0,Pass,1,1,1,229,76.333333,first,1,3

In [21]:
df.columns

Index(['Unnamed: 0', 'gender', 'race/ethnicity', 'parental level of education',
       'lunch', 'test preparation course', 'math score', 'reading score',
       'writing score', 'gender_map', 'race/ethinicity_map',
       'parental_level_of_education_map', 'lunch_map',
       'test_preparation_course_map', 'Result', 'math_performance',
       'reading_performance', 'writing_performance', 'total', 'percentage',
       'grades', 'Result_map', 'grades_map'],
      dtype='object')

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
Unnamed: 0                         1000 non-null int64
gender                             1000 non-null object
race/ethnicity                     1000 non-null object
parental level of education        1000 non-null object
lunch                              1000 non-null object
test preparation course            1000 non-null object
math score                         1000 non-null int64
reading score                      1000 non-null int64
writing score                      1000 non-null int64
gender_map                         1000 non-null int64
race/ethinicity_map                1000 non-null int64
parental_level_of_education_map    1000 non-null int64
lunch_map                          1000 non-null int64
test_preparation_course_map        1000 non-null int64
Result                             1000 non-null object
math_performance                   1000 non-null int64
reading_performance                1000 non-null int64
writing_performance                1000 non-null int64
total                              1000 non-null int64
percentage                         1000 non-null float64
grades                             939 non-null object
Result_map                         1000 non-null int64
grades_map                         1000 non-null int64
dtypes: float64(1), int64(15), object(7)
memory usage: 152.4+ KB

Hence, the data is cleaned.

# Data Analysis

Determining passed and failed students in all subjects:

In [23]:
df['Result']=np.where((df['math score']<40) | (df['reading score']<40) | (df['writing score']<40), 'Fail', 'Pass')

In [24]:
df.head()

,Unnamed: 0,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_map,...,test_preparation_course_map,Result,math_performance,reading_performance,writing_performance,total,percentage,grades,Result_map,grades_map
0,0,female,group B,bachelor's degree,standard,none,72,72,74,1,...,0,Pass,1,1,1,218,72.666667,first,1,3
1,1,female,group C,some college,standard,completed,69,90,88,1,...,1,Pass,1,1,1,247,82.333333,Distinction,1,4
2,2,female,group B,master's degree,standard,none,90,95,93,1,...,0,Pass,1,1,1,278,92.666667,Distinction,1,4
3,3,male,group A,associate's degree,free/reduced,none,47,57,44,0,...,0,Pass,1,1,1,148,49.333333,third,1,1
4,4,male,group C,some college,standard,none,76,78,75,0,...,0,Pass,1,1,1,229,76.333333,first,1,3

Identifying students passed and failed in each subjects:

In [25]:
pass_mark=40

In [26]:
df['math_performance'] = np.where (df['math score']>=pass_mark, '1', '0')
df['reading_performance'] = np.where (df['reading score']>=pass_mark, '1', '0')
df['writing_performance'] = np.where (df['writing score']>=pass_mark, '1', '0')

Here, 1 represents pass and 0 represents fail.

In [27]:
df.head()

,Unnamed: 0,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_map,...,test_preparation_course_map,Result,math_performance,reading_performance,writing_performance,total,percentage,grades,Result_map,grades_map
0,0,female,group B,bachelor's degree,standard,none,72,72,74,1,...,0,Pass,1,1,1,218,72.666667,first,1,3
1,1,female,group C,some college,standard,completed,69,90,88,1,...,1,Pass,1,1,1,247,82.333333,Distinction,1,4
2,2,female,group B,master's degree,standard,none,90,95,93,1,...,0,Pass,1,1,1,278,92.666667,Distinction,1,4
3,3,male,group A,associate's degree,free/reduced,none,47,57,44,0,...,0,Pass,1,1,1,148,49.333333,third,1,1
4,4,male,group C,some college,standard,none,76,78,75,0,...,0,Pass,1,1,1,229,76.333333,first,1,3

Making new column to give grades to sudents:

In [28]:
df['total']=df['math score']+df['reading score']+df['writing score']

In [29]:
df['percentage']=(df['total']/300*100)

In [30]:
def grades(row):
    if(row['math score']>40) & (row['reading score']>40) &(row['writing score']>40):
        if (row['percentage']>40)&(row['percentage']<=50):
            return ('third')
        elif(row['percentage']>50)&(row['percentage']<=60):
            return('second')
        elif(row['percentage']>60)&(row['percentage']<80):
            return('first')
        elif(row['percentage']>=80):
            return('Distinction')
    else:
            return('fail')

In [31]:
row=df[['math score','reading score','writing score','percentage']]

In [32]:
df['grades']=df.apply(lambda row:grades(row),axis=1)

In [33]:
df.head()

,Unnamed: 0,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_map,...,test_preparation_course_map,Result,math_performance,reading_performance,writing_performance,total,percentage,grades,Result_map,grades_map
0,0,female,group B,bachelor's degree,standard,none,72,72,74,1,...,0,Pass,1,1,1,218,72.666667,first,1,3
1,1,female,group C,some college,standard,completed,69,90,88,1,...,1,Pass,1,1,1,247,82.333333,Distinction,1,4
2,2,female,group B,master's degree,standard,none,90,95,93,1,...,0,Pass,1,1,1,278,92.666667,Distinction,1,4
3,3,male,group A,associate's degree,free/reduced,none,47,57,44,0,...,0,Pass,1,1,1,148,49.333333,third,1,1
4,4,male,group C,some college,standard,none,76,78,75,0,...,0,Pass,1,1,1,229,76.333333,first,1,3

In [34]:
#Checking unique values and mapping result column to numerical data column
df['Result'].unique()

array(['Pass', 'Fail'], dtype=object)

In [35]:
result={'Pass':1, 'Fail':0}
df['Result_map']=df['Result'].map(result)

In [36]:
#Checking unique values and mapping grades column to numerical data column
df['grades'].unique()

array(['first', 'Distinction', 'third', 'fail', 'second'], dtype=object)

In [37]:
grade={'first':3, 'Distinction':4, 'second':2,'third':1,'fail':0}
df['grades_map']=df['grades'].map(grade)

In [38]:
df['grades_map'].head()

0    3
1    4
2    4
3    1
4    3
Name: grades_map, dtype: int64

In [39]:
df.isnull().sum()

Unnamed: 0                         0
gender                             0
race/ethnicity                     0
parental level of education        0
lunch                              0
test preparation course            0
math score                         0
reading score                      0
writing score                      0
gender_map                         0
race/ethinicity_map                0
parental_level_of_education_map    0
lunch_map                          0
test_preparation_course_map        0
Result                             0
math_performance                   0
reading_performance                0
writing_performance                0
total                              0
percentage                         0
grades                             0
Result_map                         0
grades_map                         0
dtype: int64

The dataset is completely cleaned.

In [41]:
df.to_csv('cleaned_data.csv')